@alexsomesan it seems to work as expected on the terraform-provider-kubernetes `update-sdk` branch after also including this branch via:

```
go get github.com/hashicorp/terraform-plugin-go@bflad-tftypes-DynamicPseudoType-values
go mod tidy
go mod vendor
```

But please reach out if it doesn't.

```console
$ terraform apply
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - bflad/framework in /Users/bflad/go/bin
│  - hashicorp/awscc in /Users/bflad/go/bin
│  - hashicorp/corner in /Users/bflad/go/bin
│  - hashicorp/hashicups in /Users/bflad/go/bin
│  - hashicorp/kubernetes in /Users/bflad/go/bin
│  - hashicorp.com/edu/hashicups in /Users/bflad/go/bin
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_manifest.test-configmap will be created
  + resource "kubernetes_manifest" "test-configmap" {
      + manifest = {
          + apiVersion = "v1"
          + data       = {
              + foo = "bar"
            }
          + kind       = "ConfigMap"
          + metadata   = {
              + labels    = {
                  + app         = "test-app"
                  + environment = "production"
                }
              + name      = "test-config"
              + namespace = "default"
            }
        }
      + object   = {
          + apiVersion = "v1"
          + binaryData = (known after apply)
          + data       = {
              + "foo" = "bar"
            }
          + immutable  = (known after apply)
          + kind       = "ConfigMap"
          + metadata   = {
              + annotations                = (known after apply)
              + clusterName                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "test-config"
              + namespace                  = "default"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

kubernetes_manifest.test-configmap: Creating...
kubernetes_manifest.test-configmap: Creation complete after 0s

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```